esb/src/main/resources/template/velocity/GetPatientDetailsBySearch.vm

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:itk="urn:nhs-itk:ns:201005">
    <soap:Header xmlns:local="local-namespace-uri">
        <wsa:MessageID>__MESSAGEID__</wsa:MessageID>
        <wsa:Action>urn:nhs-itk:services:201005:getNHSNumber-v1-0</wsa:Action>
        <wsa:To>__SENDTO__</wsa:To>
        <local:LocalHeaderElement>getNHSNumber_48350_GNN-1_.xml</local:LocalHeaderElement>
        <wsa:From>
            <wsa:Address>http://localhost:4000</wsa:Address>
        </wsa:From>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="BB97EA1C-3605-F8C3-E040-950AE0736657">
                <wsu:Created>__TIMESTAMP__</wsu:Created>
                <wsu:Expires>__EXPIRES__</wsu:Expires>
            </wsu:Timestamp>
            <wsse:UsernameToken>
                <wsse:Username>TKS Server test</wsse:Username>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <itk:DistributionEnvelope xmlns:itk="urn:nhs-itk:ns:201005"
                                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <itk:header service="urn:nhs-itk:services:201005:getNHSNumber-v1-0" trackingid="BB97EA1C-3605-F8C3-E040-950AE0736657">
                <itk:auditIdentity>
                    <itk:id uri="urn:nhs-uk:identity:adr:ods:REC:localOrgID"/>
                </itk:auditIdentity>
                <itk:manifest count="1">
                    <itk:manifestitem profileid="urn:nhs-en:profile:getNHSNumberRequest-v1-0" mimetype="text/xml" base64="false" compressed="false" id="BB97EA1C-3605-F8C3-E040-950AE0736657" encrypted="false"/>
                </itk:manifest>
            </itk:header>
            <itk:payloads count="1">
                <itk:payload id="BB97EA1C-3605-F8C3-E040-950AE0736657">
                    <getNHSNumberRequest-v1-0 xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="urn:hl7-org:v3 ../../Schemas/QUPA_MT000002GB01.xsd" moodCode="EVN" classCode="CACT">
                        <id root="BB97EA1C-3606-F8C3-E040-950AE0736657"/>
                        <code code="getNHSNumberRequest-v1-0" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.284"/>
                        <queryEvent>

                            #if($body.dateOfBirth && !$body.dateOfBirth.empty)
                            <Person.DateOfBirth>
                                <value value="19080403"/>
                                <semanticsText>Person.DateOfBirth</semanticsText>
                            </Person.DateOfBirth>
                            #end

                            #if(!$body.gender && !$body.gender.empty)
                            <Person.Gender>
                                <value code="1" codeSystem="2.16.840.1.113883.2.1.3.2.4.16.25"/>
                                <semanticsText>Person.Gender</semanticsText>
                            </Person.Gender>
                            #end

                            <Person.Name>
                                <value>
                                    <given>${body.firstName}</given>
                                    <family>${body.lastName}</family>
                                </value>
                                <semanticsText>Person.Name</semanticsText>
                            </Person.Name>

                            #if($body.postcode && !$body.postcode.empty)
                            <Person.Postcode>
                                <value>
                                    <postalCode>${body.postcode}</postalCode>
                                </value>
                                <semanticsText>Person.Postcode</semanticsText>
                            </Person.Postcode>
                            #end

                        </queryEvent>
                    </getNHSNumberRequest-v1-0>
                </itk:payload>
            </itk:payloads>
        </itk:DistributionEnvelope>
    </soap:Body>
</soap:Envelope>
